---
kind: property
id: P:Autodesk.Revit.DB.Structure.RebarContainerItem.IncludeLastBar
source: html/a4a23934-9f45-e5a9-6352-752f8595619b.htm
---
# Autodesk.Revit.DB.Structure.RebarContainerItem.IncludeLastBar Property

Identifies if the last bar in rebar set is shown.

## Syntax (C#)
```csharp
public bool IncludeLastBar { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.InapplicableDataException** - This rebar element represents a single bar (the layout rule is Single).